**FREE

Dcl-PR OpenSpool  EXTPROC('OPENSPOOL');
End-PR;

Dcl-PR WriteLog  EXTPROC('WRITELOG');
    NIVEAU CHAR(5) CONST;
    MESSAGE CHAR(512) CONST;
End-PR;

Dcl-PR CloseSpool  EXTPROC('CLOSESPOOL');
End-PR;
